Revit 2027 API
DisciplineTypeId.Architecture Property
 Architecture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Architecture { get; }
Public Shared ReadOnly Property Architecture As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Architecture {
	ForgeTypeId^ get ();
}
static member Architecture : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
DisciplineTypeId Class
Autodesk.Revit.DB Namespace